{"data":{"site":{"siteMetadata":{"title":"brennx0rblog.","author":"Brenna Flood"}},"markdownRemark":{"id":"775d8706-4e1e-5696-9415-20b8be1e5dda","excerpt":"While I’ve been on sabbatical, I’ve used the time to revisit and tackle projects that I’ve been putting off for one reason or another. One…","html":"<p>While I’ve been on sabbatical, I’ve used the time to revisit and tackle projects that I’ve been putting off for one reason or another. One project in that list has been to set up my Switch to Stream to Twitch using my home office desk workstation setup so that I can chat with the online community and share my Animal Crossing: New Horizons Island, based on places in Bermuda - including St. David’s, Fort St. Catherine, Cupmatch pitch and fan site, the Hamilton Princess spa, and more! </p>\n<p>After spending a few hours looking at software options, testing them out for my needs, I ran into some traps and hazards before finally getting everything settled. With that in mind, I thought it would be useful to share the setup experience with y’all.</p>\n<h2>My Use Case and Desired Outcomes</h2>\n<p><strong>VIP:</strong></p>\n<ul>\n<li>Switch content shared to Twitch</li>\n<li>Gameplay sound and commentary sound available to Twitch</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul>\n<li>Locally, be able to listen to the video game music AND be able to provide commentary simultaneously</li>\n<li>Customizable transition screens to make the Twitch experience more professional</li>\n<li>Sharing profile video on the stream</li>\n<li>Custom stats, new subs, other metadata on the stream</li>\n</ul>\n<h2>Getting Started</h2>\n<h3>Hardware</h3>\n<ul>\n<li>A Nintendo Switch with dock (dock is required to get HDMI output)</li>\n<li>An A/V capture device (this tutorial will focus specifically on the Elgato HD60S)</li>\n</ul>\n<h3>Cabling</h3>\n<ul>\n<li>One USBC cable</li>\n<li>One HDMI cable</li>\n</ul>\n<p>… and finally: </p>\n<h3>Software</h3>\n<ul>\n<li>A software studio solution that you can use to display the captured video and audio</li>\n</ul>\n<p>In this tutorial, I will go over 2 options: <strong>OBS and Elgato Game Capture HD</strong>. </p>\n<p>Please keep in mind that this doesn’t cover the full range of what’s out there, and like all tech tutorials, the value of this information is going to degrade over time as new versions of software become available and compatibilty, experiences change.</p>\n<h2>Hardware / Cabling Setup</h2>\n<p>Regardless of the software you choose, the hardware and cabling setup will be the same. Below is a rough outline of what that looks like.</p>\n<p>&#x3C;&#x3C;&#x3C;<INSERT DIAGRAM HERE>>>></p>\n<h2>OBS vs. Elgato Software</h2>\n<p>First off</p>\n<h2>OBS Setup Experience</h2>\n<h2>Elgato Software Setup Experience</h2>\n<h2>🌯 In Conclusion…</h2>","frontmatter":{"title":"Setting up Nintendo Switch with Elgato HD60S For Twitch Streaming","date":"March 31, 2021"}}},"pageContext":{"slug":"/Switch_Elgato_Twitch_Setup/","previous":{"fields":{"slug":"/2019_uk_trip/"},"frontmatter":{"title":"Planning Our Recent 2019 UK Trip! 🚀 💂‍♀️"}},"next":null}}