{"data":{"site":{"siteMetadata":{"title":"brennx0rblog.","author":"Brenna Flood"}},"markdownRemark":{"id":"775d8706-4e1e-5696-9415-20b8be1e5dda","excerpt":"While I’ve been on sabbatical, I’ve used the time to revisit and tackle projects that I’ve been putting off for one reason or another. One…","html":"<p>While I’ve been on sabbatical, I’ve used the time to revisit and tackle projects that I’ve been putting off for one reason or another. One project in that list has been to set up my Switch to Stream to Twitch using my home office desk workstation setup so that I can chat with the online community and share my Animal Crossing: New Horizons Island, based on places in Bermuda - including St. David’s, Fort St. Catherine, Cupmatch pitch and fan site, the Hamilton Princess spa, and more! </p>\n<p>After spending a few hours looking at software options, testing them out for my needs, I ran into some traps and hazards before finally getting everything settled. With that in mind, I thought it would be useful to share the setup experience with y’all.</p>\n<h2>My Use Case and Desired Outcomes</h2>\n<p><strong>MVP:</strong></p>\n<ul>\n<li>Switch content shared to Twitch</li>\n<li>Gameplay sound and commentary sound available to Twitch</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul>\n<li>Locally, be able to listen to the video game music AND be able to provide commentary simultaneously</li>\n<li>Customizable transition screens to make the Twitch experience more professional</li>\n<li>Sharing profile video on the stream</li>\n<li>Custom stats, new subs, other metadata on the stream</li>\n</ul>\n<h2>Getting Started</h2>\n<h3>Hardware</h3>\n<ul>\n<li>A Nintendo Switch with dock (dock is required to access HDMI output)</li>\n<li>An A/V capture device (this tutorial will focus specifically on the Elgato HD60S)</li>\n<li>a MacBook Pro</li>\n</ul>\n<h3>Cabling</h3>\n<ul>\n<li>One USBC cable</li>\n<li>One HDMI cable</li>\n</ul>\n<p>… and finally: </p>\n<h3>Software</h3>\n<ul>\n<li>A software studio solution that you can use to display the captured video and audio</li>\n</ul>\n<p>In this tutorial, I will go over 2 options: <strong>OBS and Elgato Game Capture HD</strong>. </p>\n<p>Please keep in mind that this doesn’t cover the full range of what’s out there, and like all tech tutorials, the value of this information is going to degrade over time as new versions of software become available and compatibilty, experiences change.</p>\n<h2>Hardware / Cabling Setup</h2>\n<p>Below is a rough outline of what that looks like.</p>\n<p><img src=\"../switch_elgato_computer_hardware_setup.png\" alt=\"Hardware Setup Topology\"></p>\n<h2>OBS Setup Experience</h2>\n<p>First off, I wanted to download and install the latest version of OBS. At the time of this blog post, that version is v 27.2.4 (3/29/22). Once this version is installed, there are some other software dependencies that you must install before OBS will work properly:</p>\n<ul>\n<li>OBS Link (<a href=\"https://help.elgato.com/hc/en-us/articles/360031363132-OBS-Link-Setup\">https://help.elgato.com/hc/en-us/articles/360031363132-OBS-Link-Setup</a>)</li>\n</ul>\n<p>BIG NOTES ON FUNCTIONALITY:</p>\n<ul>\n<li>OBS Link is not compatible with Apple Silicon Macs.</li>\n<li>OBS Link has a latency around ~250ms. </li>\n</ul>\n<p>While the latency might not seem like a big deal for some games (Animal Crossing or other chill puzzle games), for others (like sidescrollers, action, etc.) it means that the “feel” in response time made the games nearly unplayable. </p>\n<p>I tried hacking at the latency for better performance, and while there is a mode for the NDI input in OBS for “better performance” I’ve found it only works for about 30 seconds, then the latency increases, followed by the game sound crashing and cutting out. The only way to resolve that behavior was to entirely quit and restart OBS. In short, a very poor experience.</p>\n<h2>Elgato Software Setup Experience</h2>\n<p>Over on the Elgato-native software side, I installed Elgato Game Capture HD v2.11.14 (<a href=\"https://www.elgato.com/en/game-capture-software\">https://www.elgato.com/en/game-capture-software</a>)</p>\n<p>After installation, I found that it was pretty straight-forward to set up the elgato device, the sound setup, the microphone setup, as well as the set up of some custom transitions screens. The only issue I came across that I have yet to resolve is that I cannot play game sound locally when I have “Commentary” turned on - even if I want to pipe out the game audio via headphones. I should also note here that the audience experience is that they will hear both. I reckon that this is a feature of the software to avoid echo or looping issues in sound.</p>\n<p>In an upcoming blog post, I’ll delve a little deeper into the UI/UX of this application, as well as setting up the transitions screens, setting up gaming stats from Twitch, and more - stay tuned!</p>\n<h2>🌯 In Conclusion…</h2>\n<p>I was very pleasantly surprised by the experience in picking up and using Game Capture HD vs. OBS. While I have been an OBS user in the past, the recent software changes that required OBS Link to be installed cut the usability and functionality I need for my use cases. While I will continue to use OBS for other purposes, I recommend that if folks have the Elgato HD60S that they use Game Capture HD instead as it’s easier to use and set up, doesn’t have latency issues, and simply has better performance.</p>","frontmatter":{"title":"Setting up Nintendo Switch with Elgato HD60S For Twitch Streaming","date":"March 31, 2021"}}},"pageContext":{"slug":"/Switch_Elgato_Twitch_Setup/","previous":{"fields":{"slug":"/2019_uk_trip/"},"frontmatter":{"title":"Planning Our Recent 2019 UK Trip! 🚀 💂‍♀️"}},"next":null}}