{"data":{"site":{"siteMetadata":{"title":"brennx0rblog.","author":"Brenna Flood"}},"markdownRemark":{"id":"59e2b550-a49c-5cc0-9780-c5c1978f4b1b","excerpt":"A couple months ago I purchased a Cricut Explore Air 2 following the binge watch of YouTube videos showcasing comparisons between various…","html":"<p>A couple months ago I purchased a Cricut Explore Air 2 following the binge watch of YouTube videos showcasing comparisons between various models. <a href=\"https://www.youtube.com/watch?v=Ch23OY8z5Fo\">This video</a> was great in doing various tests (cut precision, speed test, sound test) between the machines, which led me to buy the Cricut!</p>\n<p>Things have been quite busy, and the poor Cricut consequently sat in the corner. Yesterday, I decided to unbox it and do a couple of basic projects to better understand the features. <strong><em>Verdict:</em></strong> It’s an awesome little machine and I’m looking forward to using it for all sorts of different projects.</p>\n<p>The first big project? Bullet Journaling template stickers!</p>\n<p>Right now I’m putting together the scaffold of a YouTube video on the subject of effective bullet journaling, which will lead into a quick how-to on creating templates for quickly putting together a new book.</p>\n<h2>Scaffold</h2>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">- What is/Why Bullet Journaling?\n- General Starting Layout\n  - Intro \n- Modifying the &#39;Default&#39; Layout\n- Bullet Journaling as Agile\n- Demo / Process\n  - Starting point: Chronological notebook (not using bullet journaling, per say)\n  - Iteration: Noticing Patterns, Grouping What&#39;s Important\n  - Create the Bullet Journal\n    - Draw out the format \n    - Create Template Stickers\n    - Move boldly forward</code></pre></div>\n<p>I hope that y’all enjoy it once it’s posted.</p>","frontmatter":{"title":"Bullet-Journaling","date":"December 12, 2018"}}},"pageContext":{"slug":"/bullet-journaling/","previous":{"fields":{"slug":"/updating-site-woes-ensue/"},"frontmatter":{"title":"Updating website; Woes Ensue!"}},"next":null}}