{"data":{"site":{"siteMetadata":{"title":"brennx0rblog.","author":"Brenna Flood"}},"markdownRemark":{"id":"402e34e3-1f1c-5e34-9b96-98c014ba9093","excerpt":"After taking a break earlier this year, I am excited to announce that I am officially looking for my next career adventure, interviewing now…","html":"<p>After taking a break earlier this year, I am excited to announce that I am officially looking for my next career adventure, interviewing now with the goal of beginning with a company in early CYQ3 this year (August - September preferred).</p>\n<p>For prospective employers, I have put together a reverse job posting, using the approach I’ve seen most recently used by the amazing Julie Pagano (<a href=\"https://juliepagano.com/blog/2022/04/21/available-for-work-late-2022/\">hire her!</a>). I hope this format will prove useful for folks who want to know a little bit more about me than what’s contained within my resume.</p>\n<ul>\n<li><a href=\"#When\">When</a></li>\n<li><a href=\"#Where\">Where</a></li>\n<li><a href=\"#About-Me\">About me</a></li>\n<li>\n<p>What I’m looking for</p>\n<ul>\n<li>Location &#x26; work hours</li>\n<li>Size</li>\n<li>Type of work</li>\n<li>Culture</li>\n<li>Extras</li>\n<li>Pros</li>\n<li>Cons</li>\n<li>Dealbreakers</li>\n</ul>\n</li>\n<li>Contact me</li>\n<li>FAQs</li>\n</ul>\n<h2><a id=\"When\">⌚️ When</a></h2>\n<p>While I am actively engaging in interview discussions beginning <strong>now</strong>, please be aware that <strong>my preferred earliest start date is Monday, August 1st</strong>, and my latest preferred start date is Monday, October 3rd. </p>\n<p>That said, if your preferred start date for an open role is earlier than this time frame, I am open to the discussion regarding an earlier start date. Let’s chat!</p>\n<h2><a id=\"Where\"> Where</a></h2>\n<p>I live in Seattle, WA. I am exclusively looking to join remote / distributed-first organizations aligned to support core working hours between 9AM - 5PM Pacific, or otherwise completely flexible hours. </p>\n<p>While I am open to work travel once the COVID-19 pandemic is over, at this current time I will not be open to travel. Alternatively, I am happy to attend any organizational events remotely.</p>\n<p>I deeply miss collaborating with colleagues in in-person settings (summits, off-site events, etc.), and I am looking forward to a future where it is safe to return to this type of collaboration.</p>\n<h2><a id=\"About-Me\">About Me </a></h2>\n<p>If you are looking for high-level information about my professional experience, please refer to my resume or <a href=\"https://www.linkedin.com/in/brennaflood\">LinkedIn profile</a>.</p>\n<h2>What I’m looking for</h2>\n<h3>Location &#x26; Work Hours</h3>\n<h3>Size</h3>\n<h3>Type of Work</h3>\n<h3>Culture</h3>\n<h3>Extras</h3>\n<h3>Pros</h3>\n<h3>Cons</h3>\n<h3>Dealbreakers</h3>\n<h2>Contact me</h2>\n<h2>🌯 In Conclusion…</h2>","frontmatter":{"title":"🔭  Looking Ahead Towards the Next Adventure","date":"May 19, 2021"}}},"pageContext":{"slug":"/looking-for-next-adventure/","previous":{"fields":{"slug":"/Switch_Elgato_Twitch_Setup/"},"frontmatter":{"title":"Setting up Nintendo Switch with Elgato HD60S For Twitch Streaming"}},"next":null}}