{"data":{"site":{"siteMetadata":{"title":"brennx0rblog.","author":"Brenna Flood"}},"markdownRemark":{"id":"775d8706-4e1e-5696-9415-20b8be1e5dda","excerpt":"I’m so thankful to be on sabbatical, where I have the time and space to recharge and tackle projects that I’ve been putting off for one…","html":"<p>I’m so thankful to be on sabbatical, where I have the time and space to recharge and tackle projects that I’ve been putting off for one reason or another. One project in that list: Set up my Switch to Stream to Twitch using my home office desk workstation setup so that I can chat with the online community and share my Animal Crossing: New Horizons Island, based on places in Bermuda - including St. David’s, Fort St. Catherine, Cupmatch pitch, the Hamilton Princess spa, and more! As you all may be aware, this version of Animal Crossing released soon after many folks went into COVID lockdown in 2020, and this was a way to stay sane and stave off being quite homesick.</p>\n<p>After spending time running into some traps and hazards before finally getting everything settled, I thought it would be useful to share the setup experience with y’all.</p>\n<h2>Getting Started</h2>\n<p>At a glance, you will need:</p>\n<h3>Hardware</h3>\n<ul>\n<li>A Nintendo Switch with dock (dock is required to get HDMI output)</li>\n<li>An A/V capture device (this tutorial will focus specifically on the Elgato HD60S)</li>\n</ul>\n<h3>Cabling</h3>\n<ul>\n<li>One USBC cable</li>\n<li>One HDMI cable</li>\n</ul>\n<h3>Software</h3>\n<ul>\n<li>A software studio solution that you can use to display the captured video and audio</li>\n</ul>\n<p>In this tutorial, I will go over 2 options available. Please keep in mind that this doesn’t cover the full range of what’s out there, and like all tech tutorials, the value of this information is going to degrade over time as new versions of software become available and compatibilty, experiences change.</p>\n<h2>OBS vs. Elgato Software</h2>\n<h2>OBS Setup Experience</h2>\n<h2>Elgato Software Setup Experience</h2>\n<h2>🌯 In Conclusion…</h2>","frontmatter":{"title":"Setting up Nintendo Switch with Elgato HD60S For Twitch Streaming","date":"March 31, 2021"}}},"pageContext":{"slug":"/Switch_Elgato_Twitch_Setup/","previous":{"fields":{"slug":"/2019_uk_trip/"},"frontmatter":{"title":"Planning Our Recent 2019 UK Trip! 🚀 💂‍♀️"}},"next":null}}